tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'
tap 'homebrew/services'
tap 'azure/functions'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'romkatv/powerlevel10k'
tap 'isen-ng/dotnet-sdk-versions'
tap 'microsoft/git'

cask 'azure-data-studio'
cask 'raycast'
cask 'cleanmymac'
cask 'confluent-cli'
cask 'docker'
cask 'dotnet-sdk6-0-400'
cask 'firefox'
cask 'git-credential-manager-core'
cask 'google-chrome'
cask 'grammarly'
cask 'iterm2'
cask 'microsoft-auto-update'
cask 'microsoft-excel'
cask 'microsoft-edge'
cask 'microsoft-powerpoint'
cask 'microsoft-word'
cask 'miniforge'
cask 'postman'
cask 'snagit'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'vlc'

brew 'azure-cli'
brew 'azure-functions-core-tools@4'
brew 'hugo'
brew 'maven'
brew 'openjdk'
brew 'pandoc'
brew 'powerlevel10k'
brew 'libpq'

mas 'Microsoft OneNote', id: 784801555
mas 'OneDrive', id: 823766827
mas 'ScreenBrush', id: 1233965871








