tap "azure/functions"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "isen-ng/dotnet-sdk-versions"
tap "microsoft/git"
tap "romkatv/powerlevel10k"
brew "azure-cli"
brew "git"
brew "hugo"
brew "libpq"
brew "mas"
brew "openjdk"
brew "maven"
brew "pandoc"
brew "powerlevel10k"
brew "azure/functions/azure-functions-core-tools@4"
cask "alt-tab"
cask "azure-data-studio"
cask "citrix-workspace"
cask "cleanmymac"
cask "confluent-cli"
cask "docker"
cask "dotnet-sdk"
cask "firefox"
cask "git-credential-manager"
cask "google-chrome"
cask "grammarly"
cask "iterm2"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "miniforge"
cask "path-finder"
cask "postman"
cask "raycast"
cask "snagit"
cask "sublime-text"
cask "visual-studio-code"
cask "vlc"
mas "Microsoft OneNote", id: 784801555
mas "OneDrive", id: 823766827
# mas "ScreenBrush", id: 1233965871
mas "DemoPro", id: 1384206666
vscode "Azurite.azurite"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-account"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
